/** класс отвечающий за все действия происходящие в игре */
export class actionController{


    /** Конструктор класса - отвечающего за все действия происходящие в игре
     * @constructor
     */
    constructor() {
    }

    // Каждыйе n-мс выполнять цикл, отдельно от отрисовки
    //   - выполнить действие на каждый ша
    //   - выполнить действие каждого отдельного спрайта
    // Добавить  действие на каждый шаг
    // Перенаправлять клики на спрайты
    // Обработка событий пересечения
    // Обработка событий векторов
    // Обработка событий горячих клавиш
    // Сопоставление "игровых событий" с их обработчиками. Типо шина событий и подписанты на очереди
}