/** Класс отвечающий за камеру (глаза игрока) в игре  */
export class Camera{
    /** Конструктор класса - отвечающего за камеру (глаза игрока) в игре
    * @constructor
    */
    constructor() {
    }

// - Камера
//   -- перемещение (у камеры есть "центральная координата" на которую она смотрит. Эта центральная координата ровно по центру canvas-a)
//   -- удаление \ приближение к указанной точке (колесико мыши\движение пальцев)
//   -- фиксация (пока только временная) на указанном объекте (+возможность смещения)
}