/** Класс отвечающий за дебаг-режим (режим разработчика) в игре. Выводит на экран кучу дополнительный инфы  */
export class camera{
    /** Конструктор класса - отвечающего  за дебаг-режим (режим разработчика) в игре. Выводит на экран кучу дополнительный инфы
    * @constructor
    */
    constructor() {
    }
    
// - Режим разработчика:
//   -- переключать дебаг\нормальный режим по горячей клавиши
//   -- логгирование (в консоль)
//   -- [v.2] добавлять\удалять объекты на карте, сохранять карту
//   -- иметь вывод текста на UI для дебага
//      -- просто текст, который кинули в лог
//      -- где сейчас мышь + текущий масштаб
//      -- fps движка (а не отрисовки)
//      -- связь с сервером (пинг)
//      -- событие игрока воспринятое движком
//      -- при нажатии на объект выводится информация об объекте
//      -- видеть "маску"(рамку) спрайтов, чтобы понимать где они реагируют на клик мышью
//         -- зеленым цветом - значит пропускат клик
//         -- фиолетовым цветом - значит на клик должен откликаться
}